import os

# 错误字典
ERROR_DICT = {
    0: '成功',
    11000: '手机号不能低于4位',
    11001: '手机号必须为纯数字',
    11002: '密码格式错误',
    11003: '密码不正确',
    11004: '用户不存在',
    11005: '此账号已经注册',
    11006: '没有token',
    11007: '无权限打开',
    11008: 'token已过期',
    11009: '无效的token',
    11010: 'token认证失败请登录',
    99901: '参数缺失',
    99902: '参数异常',
    99903: '参数重复',
    99904: '系统错误',
    99905: '请登录之后再操作',
    99906: '找不到对象',
    99907: '权限不足',
    22201: '查询不到信息',
}

SECRET_KEY = '!k%4p0k%2iogplitxwqym@p8o+@j3-tha%e#c)&#+g6kp#i+u9'